#### 📖 Terraform Plan ('infra-pe/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.postgresql_db.module.postgresql_db.azurerm_monitor_metric_alert.replica["active_connections"] will be created
  + resource "azurerm_monitor_metric_alert" "replica" {
      + auto_mitigate            = true
      + enabled                  = false
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "io-p-itn-cgn-pe-postgresql-psql-replica-01-ACTIVE_CONNECTIONS"
      + resource_group_name      = "io-p-itn-cgn-pe-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 2
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT30M"

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "active_connections"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.postgresql_db.module.postgresql_db.azurerm_monitor_metric_alert.replica["connections_failed"] will be created
  + resource "azurerm_monitor_metric_alert" "replica" {
      + auto_mitigate            = true
      + enabled                  = false
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "io-p-itn-cgn-pe-postgresql-psql-replica-01-CONNECTIONS_FAILED"
      + resource_group_name      = "io-p-itn-cgn-pe-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 2
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT30M"

      + criteria {
          + aggregation            = "Total"
          + metric_name            = "connections_failed"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.postgresql_db.module.postgresql_db.azurerm_monitor_metric_alert.replica["cpu_percent"] will be created
  + resource "azurerm_monitor_metric_alert" "replica" {
      + auto_mitigate            = true
      + enabled                  = false
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "io-p-itn-cgn-pe-postgresql-psql-replica-01-CPU_PERCENT"
      + resource_group_name      = "io-p-itn-cgn-pe-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 2
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT30M"

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "cpu_percent"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.postgresql_db.module.postgresql_db.azurerm_monitor_metric_alert.replica["memory_percent"] will be created
  + resource "azurerm_monitor_metric_alert" "replica" {
      + auto_mitigate            = true
      + enabled                  = false
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "io-p-itn-cgn-pe-postgresql-psql-replica-01-MEMORY_PERCENT"
      + resource_group_name      = "io-p-itn-cgn-pe-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 2
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT30M"

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "memory_percent"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.postgresql_db.module.postgresql_db.azurerm_monitor_metric_alert.replica["storage_percent"] will be created
  + resource "azurerm_monitor_metric_alert" "replica" {
      + auto_mitigate            = true
      + enabled                  = false
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "io-p-itn-cgn-pe-postgresql-psql-replica-01-STORAGE_PERCENT"
      + resource_group_name      = "io-p-itn-cgn-pe-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 2
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT30M"

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "storage_percent"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.postgresql_db.module.postgresql_db.azurerm_monitor_metric_alert.this["active_connections"] will be created
  + resource "azurerm_monitor_metric_alert" "this" {
      + auto_mitigate            = true
      + enabled                  = false
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "io-p-itn-cgn-pe-postgresql-psql-01-ACTIVE_CONNECTIONS"
      + resource_group_name      = "io-p-itn-cgn-pe-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 2
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT30M"

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "active_connections"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.postgresql_db.module.postgresql_db.azurerm_monitor_metric_alert.this["connections_failed"] will be created
  + resource "azurerm_monitor_metric_alert" "this" {
      + auto_mitigate            = true
      + enabled                  = false
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "io-p-itn-cgn-pe-postgresql-psql-01-CONNECTIONS_FAILED"
      + resource_group_name      = "io-p-itn-cgn-pe-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 2
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT30M"

      + criteria {
          + aggregation            = "Total"
          + metric_name            = "connections_failed"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.postgresql_db.module.postgresql_db.azurerm_monitor_metric_alert.this["cpu_percent"] will be created
  + resource "azurerm_monitor_metric_alert" "this" {
      + auto_mitigate            = true
      + enabled                  = false
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "io-p-itn-cgn-pe-postgresql-psql-01-CPU_PERCENT"
      + resource_group_name      = "io-p-itn-cgn-pe-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 2
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT30M"

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "cpu_percent"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.postgresql_db.module.postgresql_db.azurerm_monitor_metric_alert.this["memory_percent"] will be created
  + resource "azurerm_monitor_metric_alert" "this" {
      + auto_mitigate            = true
      + enabled                  = false
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "io-p-itn-cgn-pe-postgresql-psql-01-MEMORY_PERCENT"
      + resource_group_name      = "io-p-itn-cgn-pe-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 2
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT30M"

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "memory_percent"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.postgresql_db.module.postgresql_db.azurerm_monitor_metric_alert.this["storage_percent"] will be created
  + resource "azurerm_monitor_metric_alert" "this" {
      + auto_mitigate            = true
      + enabled                  = false
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "io-p-itn-cgn-pe-postgresql-psql-01-STORAGE_PERCENT"
      + resource_group_name      = "io-p-itn-cgn-pe-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 2
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT30M"

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "storage_percent"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.postgresql_db.module.postgresql_db.azurerm_postgresql_flexible_server.replica[0] will be created
  + resource "azurerm_postgresql_flexible_server" "replica" {
      + administrator_login           = (known after apply)
      + auto_grow_enabled             = false
      + backup_retention_days         = (known after apply)
      + create_mode                   = "Replica"
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "italynorth"
      + name                          = "io-p-itn-cgn-pe-postgresql-psql-replica-01"
      + private_dns_zone_id           = (known after apply)
      + public_network_access_enabled = false
      + resource_group_name           = "io-p-itn-cgn-pe-rg-01"
      + sku_name                      = "GP_Standard_D2ds_v5"
      + source_server_id              = (known after apply)
      + storage_mb                    = 262144
      + storage_tier                  = (known after apply)
      + tags                          = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      + version                       = "16"

      + maintenance_window {
          + day_of_week  = 3
          + start_hour   = 2
          + start_minute = 0
        }
    }

  # module.postgresql_db.module.postgresql_db.azurerm_postgresql_flexible_server.this will be created
  + resource "azurerm_postgresql_flexible_server" "this" {
      + administrator_login           = (sensitive value)
      + administrator_password        = (sensitive value)
      + auto_grow_enabled             = true
      + backup_retention_days         = 14
      + create_mode                   = "Default"
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = true
      + id                            = (known after apply)
      + location                      = "italynorth"
      + name                          = "io-p-itn-cgn-pe-postgresql-psql-01"
      + private_dns_zone_id           = (known after apply)
      + public_network_access_enabled = false
      + resource_group_name           = "io-p-itn-cgn-pe-rg-01"
      + sku_name                      = "GP_Standard_D2ds_v5"
      + storage_mb                    = 262144
      + storage_tier                  = (known after apply)
      + tags                          = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      + version                       = "16"

      + high_availability {
          + mode = "ZoneRedundant"
        }

      + maintenance_window {
          + day_of_week  = 3
          + start_hour   = 2
          + start_minute = 0
        }
    }

  # module.postgresql_db.module.postgresql_db.azurerm_postgresql_flexible_server_configuration.pgbouncer[0] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgbouncer" {
      + id        = (known after apply)
      + name      = "pgbouncer.enabled"
      + server_id = (known after apply)
      + value     = "true"
    }

  # module.postgresql_db.module.postgresql_db.azurerm_postgresql_flexible_server_configuration.pgbouncer_replica[0] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgbouncer_replica" {
      + id        = (known after apply)
      + name      = "pgbouncer.enabled"
      + server_id = (known after apply)
      + value     = "True"
    }

  # module.postgresql_db.module.postgresql_db.azurerm_postgresql_flexible_server_virtual_endpoint.endpoint[0] will be created
  + resource "azurerm_postgresql_flexible_server_virtual_endpoint" "endpoint" {
      + id                = (known after apply)
      + name              = "io-p-itn-cgn-pe-postgresql-psql-ep-01"
      + replica_server_id = (known after apply)
      + source_server_id  = (known after apply)
    }

  # module.postgresql_db.module.postgresql_db.azurerm_private_endpoint.postgre_pep will be created
  + resource "azurerm_private_endpoint" "postgre_pep" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-p-itn-cgn-pe-postgresql-psql-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-cgn-pe-rg-01"
      + subnet_id                = "/subscriptions/74da48a3-b0e7-489d-8172-da79801086ed/resourceGroups/io-p-itn-cgn-pe-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-cgn-pe-vnet-01/subnets/io-p-itn-cgn-pe-pep-snet-01"
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/74da48a3-b0e7-489d-8172-da79801086ed/resourceGroups/io-p-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateDnsZones/privatelink.postgres.database.azure.com",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-itn-cgn-pe-postgresql-psql-pep-01"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "postgresqlServer",
            ]
        }
    }

  # module.postgresql_db.module.postgresql_db.azurerm_private_endpoint.replica_postgre_pep[0] will be created
  + resource "azurerm_private_endpoint" "replica_postgre_pep" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-p-itn-cgn-pe-postgresql-psql-pep-replica-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-cgn-pe-rg-01"
      + subnet_id                = "/subscriptions/74da48a3-b0e7-489d-8172-da79801086ed/resourceGroups/io-p-itn-cgn-pe-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-cgn-pe-vnet-01/subnets/io-p-itn-cgn-pe-pep-snet-01"
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/74da48a3-b0e7-489d-8172-da79801086ed/resourceGroups/io-p-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateDnsZones/privatelink.postgres.database.azure.com",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-itn-cgn-pe-postgresql-psql-pep-replica-01"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "postgresqlServer",
            ]
        }
    }

Plan: 17 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.networking.module.pep_snet.azurerm_subnet.this,
  on .terraform/modules/networking.pep_snet/subnet/main.tf line 23, in resource "azurerm_subnet" "this":
  23:   private_endpoint_network_policies_enabled     = var.private_endpoint_network_policies_enabled

`private_endpoint_network_policies_enabled` will be removed in favour of the
property `private_endpoint_network_policies` in version 4.0 of the AzureRM
Provider

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
